mdepx/mdepx/arch/arm/stm/stm32n6_dcmipp.h
/*-
 * Copyright (c) 2025 Ruslan Bukin <br@bsdpad.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 */

#ifndef _ARM_STM_STM32N6_DCMIPP_H_
#define _ARM_STM_STM32N6_DCMIPP_H_

#define	DCMIPP_IPGR1		0x000
#define	DCMIPP_IPGR2		0x004
#define	DCMIPP_IPGR3		0x008
#define	DCMIPP_IPGR8		0x01C
#define	DCMIPP_IPC1R1		0x020
#define	DCMIPP_IPC1R3		0x028
#define	DCMIPP_IPC2R1		0x030
#define	DCMIPP_IPC2R2		0x034
#define	DCMIPP_IPC2R3		0x038
#define	DCMIPP_IPC3R1		0x040
#define	DCMIPP_IPC3R2		0x044
#define	DCMIPP_IPC3R3		0x048
#define	DCMIPP_IPC4R1		0x050
#define	DCMIPP_IPC4R2		0x054
#define	DCMIPP_IPC4R3		0x058
#define	DCMIPP_IPC5R1		0x060
#define	DCMIPP_IPC5R2		0x064
#define	DCMIPP_IPC5R3		0x068
#define	DCMIPP_PRHWCFGR		0x100
#define	DCMIPP_PRCR		0x104
#define	DCMIPP_PRESCR		0x108
#define	DCMIPP_PRESUR		0x10C
#define	DCMIPP_PRIER		0x1F4
#define	DCMIPP_PRSR		0x1F8
#define	DCMIPP_PRFCR		0x1FC
#define	DCMIPP_CMCR		0x204
#define	 CMCR_INSEL_CSI2	(1 << 0) /* input selection */
#define	 CMCR_PSFC_S		1 /* Pipe selection for the frame counter */
#define	 CMCR_PSFC_PIPE0	(0 << CMCR_PSFC_S)
#define	 CMCR_PSFC_PIPE1	(1 << CMCR_PSFC_S)
#define	 CMCR_PSFC_PIPE2	(2 << CMCR_PSFC_S)
#define	DCMIPP_CMFRCR		0x208
#define	DCMIPP_CMIER		0x3F0
#define	 CMIER_P2FRAMEIE	(1 << 25)
#define	 CMIER_P2LINEIE		(1 << 24) /* Multi-line capture complete P2 */
#define	DCMIPP_CMSR1		0x3F4
#define	DCMIPP_CMSR2		0x3F8
#define	DCMIPP_CMFCR		0x3FC

#define	DCMIPP_P0FSCR		0x404
#define	 P0FSCR_PIPEN		(1 << 31)
#define	DCMIPP_P0FCTCR		0x500
#define	 P0FCTCR_CPTREQ		(1 << 3) /* Capture requested */
#define	DCMIPP_P0SCSTR		0x504
#define	DCMIPP_P0SCSZR		0x508
#define	DCMIPP_P0DCCNTR		0x5B0
#define	DCMIPP_P0DCLMTR		0x5B4
#define	DCMIPP_P0PPCR		0x5C0
#define	DCMIPP_P0PPM0AR1	0x5C4
#define	DCMIPP_P0PPM0AR2	0x5C8
#define	DCMIPP_P0STM0AR		0x5D0
#define	DCMIPP_P0IER		0x5F4
#define	DCMIPP_P0SR		0x5F8
#define	DCMIPP_P0FCR		0x5FC
#define	DCMIPP_P0CFSCR		0x604
#define	 P0CFSCR_PIPEN		(1 << 31) /* Current activation of PipeN */
#define	DCMIPP_P0CFCTCR		0x700
#define	DCMIPP_P0CSCSTR		0x704
#define	DCMIPP_P0CSCSZR		0x708
#define	DCMIPP_P0CPPCR		0x7C0
#define	DCMIPP_P0CPPM0AR1	0x7C4
#define	DCMIPP_P0CPPM0AR2	0x7C8

#define	DCMIPP_P1FSCR		0x804
#define	 P1FSCR_PIPEN		(1 << 31)
#define	 P1FSCR_FDTFEN		(1 << 30) /* Force Datatype format enable */
#define	 P1FSCR_FDTF_S		24 /* Force Datatype format */
#define	 P1FSCR_VC_S		19 /* Virtual channel ID of the CSI flow */
#define	 P1FSCR_PIPEDIFF	(1 << 18) /* Differentiates Pipe2 from Pipe1 */
#define	 P1FSCR_DTMODE_S	16 /* Flow selection mode */
#define	 P1FSCR_DTIDB_S		8
#define	 P1FSCR_DTIDA_S		0
#define	DCMIPP_P1SRCR		0x820
#define	DCMIPP_P1BPRCR		0x824
#define	DCMIPP_P1BPRSR		0x828
#define	DCMIPP_P1DECR		0x830
#define	DCMIPP_P1BLCCR		0x840
#define	 BLCCR_ENABLE		(1 << 0)
#define	 BLCCR_BLCB_S		8
#define	 BLCCR_BLCG_S		16
#define	 BLCCR_BLCR_S		24
#define	DCMIPP_P1EXCR1		0x844
#define	 EXCR1_SHFR_S		28 /* Red */
#define	 EXCR1_MULTR_S		20 /* Red */
#define	 EXCR1_ENABLE		(1 << 0)
#define	DCMIPP_P1EXCR2		0x848
#define	 EXCR2_SHFG_S		28
#define	 EXCR2_MULTG_S		20
#define	 EXCR2_SHFB_S		12
#define	 EXCR2_MULTB_S		4
#define	DCMIPP_P1ST1CR		0x850
#define	DCMIPP_P1ST2CR		0x854
#define	DCMIPP_P1ST3CR		0x858
#define	DCMIPP_P1STSTR		0x85C
#define	DCMIPP_P1STSZR		0x860
#define	DCMIPP_P1ST1SR		0x864
#define	DCMIPP_P1ST2SR		0x868
#define	DCMIPP_P1ST3SR		0x86C
#define	DCMIPP_P1DMCR		0x870
#define	 DMCR_EN		(1 << 0)
#define	 DMCR_TYPE_S		1
#define	 DMCR_TYPE_RGGB		(0 << DMCR_TYPE_S)
#define	 DMCR_TYPE_GRBG		(1 << DMCR_TYPE_S)
#define	 DMCR_TYPE_GBRG		(2 << DMCR_TYPE_S)
#define	 DMCR_TYPE_BGGR		(3 << DMCR_TYPE_S)
#define	 DMCR_PEAK_S		16
#define	 DMCR_LINEV_S		20
#define	 DMCR_LINEH_S		24
#define	 DMCR_EDGE_S		28
#define	DCMIPP_P1CCCR		0x880
#define	 CCCR_ENABLE		(1 << 0)
#define	 CCCR_TYPE		(1 << 1)	/* R, G and B */
#define	 CCCR_CLAMP		(1 << 2)
#define	DCMIPP_P1CCRR1		0x884
#define	 CCRR1_RG_S		16
#define	 CCRR1_RR_S		0
#define	DCMIPP_P1CCRR2		0x888
#define	 CCRR2_RA_S		16
#define	 CCRR2_RB_S		0
#define	DCMIPP_P1CCGR1		0x88C
#define	 CCGR1_GG_S		16
#define	 CCGR1_GR_S		0
#define	DCMIPP_P1CCGR2		0x890
#define	 CCGR2_GA_S		16
#define	 CCGR2_GB_S		0
#define	DCMIPP_P1CCBR1		0x894
#define	 CCBR1_BG_S		16
#define	 CCBR1_BR_S		0
#define	DCMIPP_P1CCBR2		0x898
#define	 CCBR2_BA_S		16
#define	 CCBR2_BB_S		0
#define	DCMIPP_P1CTCR1		0x8A0
#define	DCMIPP_P1CTCR2		0x8A4
#define	DCMIPP_P1CTCR3		0x8A8
#define	DCMIPP_P1FCTCR		0x900
#define	 P1FCTCR_CPTREQ		(1 << 3) /* Capture requested */
#define	 P1FCTCR_CPTMODE_SS	(1 << 2) /* Snapshot mode */
#define	DCMIPP_P1CRSTR		0x904
#define	DCMIPP_P1CRSZR		0x908
#define	DCMIPP_P1DCCR		0x90C
#define	DCMIPP_PxDSCR(x)	(0x910 + 0x400 * ((x) - 1))
#define	 P1DSCR_ENABLE		(1 << 31)
#define	 P1DSCR_VDIV_S		16
#define	 P1DSCR_HDIV_S		0
#define	DCMIPP_PxDSRTIOR(x)	(0x914 + 0x400 * ((x) - 1))
#define	 P1DSRTIOR_VRATIO_S	16
#define	 P1DSRTIOR_HRATIO_S	0
#define	DCMIPP_PxDSSZR(x)	(0x918 + 0x400 * ((x) - 1))
#define	 P1DSSZR_VSIZE_S	16
#define	 P1DSSZR_HSIZE_S	0
#define	DCMIPP_P1CMRICR		0x920
#define	DCMIPP_P1RIxCR1		0x924
#define	DCMIPP_P1RIxCR2		0x928
#define	DCMIPP_PxGMCR(x)	(0x970 + 0x400 * ((x) - 1))
#define	 P1GMCR_EN		(1 << 0) /* Gamma is enabled */
#define	DCMIPP_P1YUVCR		0x980
#define	DCMIPP_P1YUVRR1		0x984
#define	DCMIPP_P1YUVRR2		0x988
#define	DCMIPP_P1YUVGR1		0x98C
#define	DCMIPP_P1YUVGR2		0x990
#define	DCMIPP_P1YUVBR1		0x994
#define	DCMIPP_P1YUVBR2		0x998
#define	DCMIPP_P1PPCR		0x9C0
#define	 P1PPCR_FORMAT_S		0
#define	 P1PPCR_FORMAT_RGB888_YUV444_1	(0x0 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_RGB565		(0x1 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_ARGB8888		(0x2 << P1PPCR_FORMAT_S) /* A=0xff */
#define	 P1PPCR_FORMAT_RGBA8888		(0x3 << P1PPCR_FORMAT_S) /* A=0xff */
#define	 P1PPCR_FORMAT_MONOY8G8_1	(0x4 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_YUV444_1_32_AYUV	(0x5 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_YUV422_1_16_YUYV	(0x6 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_YUV422_2_16_NONE	(0x7 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_YUV420_2_12_NV21	(0x8 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_YUV420_3_12_YV12	(0x9 << P1PPCR_FORMAT_S)
#define	 P1PPCR_FORMAT_YUV422_1_16_UYVY	(0xa << P1PPCR_FORMAT_S)
#define	 P1PPCR_SWAPRB			(1 << 4)
#define	 P1PPCR_DBM			(1 << 16)
#define	DCMIPP_P1PPM0AR1	0x9C4
#define	DCMIPP_P1PPM0AR2	0x9C8
#define	DCMIPP_P1PPM0PR		0x9CC
#define	 P1PPM0PR_PITCH_S	0 /* Number of bytes between two lines. */
#define	DCMIPP_P1STM0A		0x9D0
#define	DCMIPP_P1PPM1AR1	0x9D4
#define	DCMIPP_P1PPM1AR2	0x9D8
#define	DCMIPP_P1PPM1PR		0x9DC
#define	DCMIPP_P1STM1AR		0x9E0
#define	DCMIPP_P1PPM2AR1	0x9E4
#define	DCMIPP_P1PPM2AR2	0x9E8
#define	DCMIPP_P1STM2AR		0x9F0
#define	DCMIPP_P1IER		0x9F4
#define	DCMIPP_P1SR		0x9F8
#define	DCMIPP_P1FCR		0x9FC
#define	DCMIPP_P1CFSCR		0xA04
#define	DCMIPP_P1CBPRCR		0xA24
#define	DCMIPP_P1CBLCCR		0xA40
#define	DCMIPP_P1CEXCR1		0xA44
#define	DCMIPP_P1CEXCR2		0xA48
#define	DCMIPP_P1CST1CR		0xA50
#define	DCMIPP_P1CST2CR		0xA54
#define	DCMIPP_P1CST3CR		0xA58
#define	DCMIPP_P1CSTSTR		0xA5C
#define	DCMIPP_P1CSTSZR		0xA60
#define	DCMIPP_P1CCCCR		0xA80
#define	DCMIPP_P1CCCRR1		0xA84
#define	DCMIPP_P1CCCRR2		0xA88
#define	DCMIPP_P1CCCGR1		0xA8C
#define	DCMIPP_P1CCCGR2		0xA90
#define	DCMIPP_P1CCCBR1		0xA94
#define	DCMIPP_P1CCCBR2		0xA98
#define	DCMIPP_P1CCTCR1		0xAA0
#define	DCMIPP_P1CCTCR2		0xAA4
#define	DCMIPP_P1CCTCR3		0xAA8
#define	DCMIPP_P1CFCTCR		0xB00
#define	DCMIPP_P1CCRSTR		0xB04
#define	DCMIPP_P1CCRSZR		0xB08
#define	DCMIPP_P1CDCCR		0xB0C
#define	DCMIPP_P1CDSCR		0xB10
#define	DCMIPP_P1CDSRTIOR	0xB14
#define	DCMIPP_P1CDSSZR		0xB18
#define	DCMIPP_P1CCMRICR	0xB20
#define	DCMIPP_P1CRIxCR1	0xB24
#define	DCMIPP_P1CRI1CR2	0xB28
#define	DCMIPP_P1CPPCR		0xBC0
#define	DCMIPP_P1CPPM0AR1	0xBC4
#define	DCMIPP_P1CPPM0AR2	0xBC8
#define	DCMIPP_P1CPPM0PR	0xBCC
#define	DCMIPP_P1CPPM1AR1	0xBD4
#define	DCMIPP_P1CPPM1AR2	0xBD8
#define	DCMIPP_P1CPPM1PR	0xBDC
#define	DCMIPP_P1CPPM2AR1	0xBE4
#define	DCMIPP_P1CPPM2AR2	0xBE8

#define	DCMIPP_P2FSCR		0xC04
#define	 P2FSCR_PIPEN		(1 << 31)
#define	 P2FSCR_FDTFEN		(1 << 30) /* Force Datatype format enable */
#define	 P2FSCR_FDTF_S		24 /* Force Datatype format */
#define	 P2FSCR_VC_S		19 /* Virtual channel ID of the CSI flow */
#define	 P2FSCR_DTIDB_S		8
#define	 P2FSCR_DTIDA_S		0
#define	DCMIPP_P2FCTCR		0xD00
#define	 P2FCTCR_CPTREQ		(1 << 3) /* Capture requested */
#define	 P2FCTCR_CPTMODE_SS	(1 << 2) /* Snapshot mode */
#define	DCMIPP_P2CRSTR		0xD04
#define	DCMIPP_P2CRSZR		0xD08
#define	DCMIPP_P2DCCR		0xD0C
#define	DCMIPP_P2DSCR		0xD10
#define	DCMIPP_P2DSRTIOR	0xD14
#define	DCMIPP_P2DSSZR		0xD18
#define	DCMIPP_P2CCMRICR	0xD20
#define	DCMIPP_P2RI1CR1		0xD24
#define	DCMIPP_P2RI1CR2		0xD28
#define	DCMIPP_P2RI2CR1		0xD2C
#define	DCMIPP_P2RI2CR2		0xD30
#define	DCMIPP_P2RI3CR1		0xD34
#define	DCMIPP_P2RI3CR2		0xD38
#define	DCMIPP_P2RI4CR1		0xD3C
#define	DCMIPP_P2RI4CR2		0xD40
#define	DCMIPP_P2RI5CR1		0xD44
#define	DCMIPP_P2RI5CR2		0xD48
#define	DCMIPP_P2RI6CR1		0xD4C
#define	DCMIPP_P2RI6CR2		0xD50
#define	DCMIPP_P2RI7CR1		0xD54
#define	DCMIPP_P2RI7CR2		0xD58
#define	DCMIPP_P2RI8CR1		0xD5C
#define	DCMIPP_P2RI8CR2		0xD60
#define	DCMIPP_P2GMCR		0xD70
#define	 P2GMCR_EN		(1 << 0) /* Gamma is enabled */
#define	DCMIPP_P2PPCR		0xDC0
#define	 P2PPCR_FORMAT_S		0
#define	 P2PPCR_FORMAT_RGB888_YUV444_1	(0x0 << P2PPCR_FORMAT_S)
#define	 P2PPCR_FORMAT_RGB565		(0x1 << P2PPCR_FORMAT_S)
#define	 P2PPCR_FORMAT_ARGB8888		(0x2 << P2PPCR_FORMAT_S) /* A=0xff */
#define	 P2PPCR_FORMAT_RGBA8888		(0x3 << P2PPCR_FORMAT_S) /* A=0xff */
#define	 P2PPCR_FORMAT_MONOY8G8_1	(0x4 << P2PPCR_FORMAT_S)
#define	 P2PPCR_FORMAT_YUV444_1_32_AYUV	(0x5 << P2PPCR_FORMAT_S)
#define	 P2PPCR_FORMAT_YUV422_1_16_YUYV	(0x6 << P2PPCR_FORMAT_S)
#define	DCMIPP_P2PPM0AR1	0xDC4
#define	DCMIPP_P2PPM0AR2	0xDC8
#define	DCMIPP_P2PPM0PR		0xDCC
#define	 P2PPM0PR_PITCH_S	0 /* Number of bytes between two lines. */
#define	DCMIPP_P2STM0AR		0xDD0
#define	DCMIPP_P2IER		0xDF4
#define	 P2IER_FRAMEIE		(1 << 1)
#define	 P2IER_LINEIE		(1 << 0)
#define	DCMIPP_P2SR		0xDF8
#define	DCMIPP_P2FCR		0xDFC
#define	 P2FCR_CFRAMEF		(1 << 1)
#define	DCMIPP_P2CFSCR		0xE04
#define	DCMIPP_P2CFCTCR		0xF00
#define	DCMIPP_P2CCRSTR		0xF04
#define	DCMIPP_P2CCRSZR		0xF08
#define	DCMIPP_P2CDCCR		0xF0C
#define	DCMIPP_P2CDSCR		0xF10
#define	DCMIPP_P2CDSRTIOR	0xF14
#define	DCMIPP_P2CDSSZR		0xF18
#define	DCMIPP_P2CRI1CR1	0xF24
#define	DCMIPP_P2CRI1CR2	0xF28
#define	DCMIPP_P2CRI2CR1	0xF2C
#define	DCMIPP_P2CRI2CR2	0xF28
#define	DCMIPP_P2CRI3CR1	0xF34
#define	DCMIPP_P2CRI3CR2	0xF38
#define	DCMIPP_P2CRI4CR1	0xF3C
#define	DCMIPP_P2CRI4CR2	0xF40
#define	DCMIPP_P2CRI5CR1	0xF44
#define	DCMIPP_P2CRI5CR2	0xF48
#define	DCMIPP_P2CRI6CR1	0xF4C
#define	DCMIPP_P2CRI6CR2	0xF50
#define	DCMIPP_P2CRI7CR1	0xF54
#define	DCMIPP_P2CRI7CR2	0xF58
#define	DCMIPP_P2CRI8CR1	0xF5C
#define	DCMIPP_P2CRI8CR2	0xF60
#define	DCMIPP_P2CPPCR		0xFC0
#define	DCMIPP_P2CPPM0AR1	0xFC4
#define	DCMIPP_P2CPPM0AR2	0xFC8

struct stm32n6_dcmipp_downsize_config {
	uint32_t hratio;
	uint32_t vratio;
	uint32_t hsize;
	uint32_t vsize;
	uint32_t hdivfactor;
	uint32_t vdivfactor;
};

struct stm32n6_dcmipp_pipe_config {
	uint32_t pipe_id;
	uint32_t base_addr;
	uint32_t pitch;
	uint32_t vc; /* CSI virtual channel */
	uint8_t flow_type;
#define	DCMIPP_FLOW_TYPE_CONTINUOUS	(1)
#define	DCMIPP_FLOW_TYPE_SNAPSHOT	(2)
	uint8_t gamma_en;
};

struct stm32n6_dcmipp_softc {
	uint32_t base;
};

void stm32n6_dcmipp_init(struct stm32n6_dcmipp_softc *sc, uint32_t base);
void stm32n6_dcmipp_status(struct stm32n6_dcmipp_softc *sc);
void stm32n6_dcmipp_setup(struct stm32n6_dcmipp_softc *sc,
    struct stm32n6_dcmipp_pipe_config *conf);
void stm32n6_dcmipp_setup_downsize(struct stm32n6_dcmipp_softc *sc, int pipe,
    struct stm32n6_dcmipp_downsize_config *conf);
void stm32n6_dcmipp_pipe2(struct stm32n6_dcmipp_softc *sc);
void stm32n6_dcmipp_pipe2_frame_request(struct stm32n6_dcmipp_softc *sc);
void stm32n6_dcmipp_intr(void *arg, int irq);

#endif /* !_ARM_STM_STM32N6_DCMIPP_H_ */
